Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEvadc_reg.h
/** \brief 1500, Queue 0 Source Contr. Register, Group 4 */
#define EVADC_G4_Q0_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021500u)
/** Alias (User Manual Name) for EVADC_G4_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G4_Q0_QCTRL.
*/
#define EVADC_G4QCTRL0 (EVADC_G4_Q0_QCTRL)

/** \brief 1504, Queue 0 Mode Register, Group 4 */
#define EVADC_G4_Q0_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021504u)
/** Alias (User Manual Name) for EVADC_G4_Q0_QMR.
* To use register names with standard convension, please use EVADC_G4_Q0_QMR.
*/
#define EVADC_G4QMR0 (EVADC_G4_Q0_QMR)

/** \brief 1508, Queue 0 Status Register, Group 4 */
#define EVADC_G4_Q0_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021508u)
/** Alias (User Manual Name) for EVADC_G4_Q0_QSR.
* To use register names with standard convension, please use EVADC_G4_Q0_QSR.
*/
#define EVADC_G4QSR0 (EVADC_G4_Q0_QSR)

/** \brief 150C, Queue 0 Register 0, Group 4 */
#define EVADC_G4_Q0_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002150Cu)
/** Alias (User Manual Name) for EVADC_G4_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G4_Q0_Q0R.
*/
#define EVADC_G4Q0R0 (EVADC_G4_Q0_Q0R)

/** \brief 1510, Queue 0 Input Register, Group 4 */
#define EVADC_G4_Q0_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021510u)
/** Alias (User Manual Name) for EVADC_G4_Q0_QINR.
* To use register names with standard convension, please use EVADC_G4_Q0_QINR.
*/
#define EVADC_G4QINR0 (EVADC_G4_Q0_QINR)

/** \brief 1514, Queue 0 Backup Register, Group 4 */
#define EVADC_G4_Q0_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021514u)
/** Alias (User Manual Name) for EVADC_G4_Q0_QBUR.
* To use register names with standard convension, please use EVADC_G4_Q0_QBUR.
*/
#define EVADC_G4QBUR0 (EVADC_G4_Q0_QBUR)

/** \brief 1518, Queue 0 Requ. Timer Mode Reg., Group 4 */
#define EVADC_G4_Q0_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021518u)
/** Alias (User Manual Name) for EVADC_G4_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G4_Q0_REQTM.
*/
#define EVADC_G4REQTM0 (EVADC_G4_Q0_REQTM)

/** \brief 151C, Queue 0 Requ. Timer Status Reg., Group 4 */
#define EVADC_G4_Q0_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002151Cu)
/** Alias (User Manual Name) for EVADC_G4_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G4_Q0_REQTS.
*/
#define EVADC_G4REQTS0 (EVADC_G4_Q0_REQTS)

/** \brief 1520, Queue 1 Source Contr. Register, Group 4 */
#define EVADC_G4_Q1_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021520u)
/** Alias (User Manual Name) for EVADC_G4_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G4_Q1_QCTRL.
*/
#define EVADC_G4QCTRL1 (EVADC_G4_Q1_QCTRL)

/** \brief 1524, Queue 1 Mode Register, Group 4 */
#define EVADC_G4_Q1_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021524u)
/** Alias (User Manual Name) for EVADC_G4_Q1_QMR.
* To use register names with standard convension, please use EVADC_G4_Q1_QMR.
*/
#define EVADC_G4QMR1 (EVADC_G4_Q1_QMR)

/** \brief 1528, Queue 1 Status Register, Group 4 */
#define EVADC_G4_Q1_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021528u)
/** Alias (User Manual Name) for EVADC_G4_Q1_QSR.
* To use register names with standard convension, please use EVADC_G4_Q1_QSR.
*/
#define EVADC_G4QSR1 (EVADC_G4_Q1_QSR)

/** \brief 152C, Queue 1 Register 0, Group 4 */
#define EVADC_G4_Q1_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002152Cu)
/** Alias (User Manual Name) for EVADC_G4_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G4_Q1_Q0R.
*/
#define EVADC_G4Q0R1 (EVADC_G4_Q1_Q0R)

/** \brief 1530, Queue 1 Input Register, Group 4 */
#define EVADC_G4_Q1_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021530u)
/** Alias (User Manual Name) for EVADC_G4_Q1_QINR.
* To use register names with standard convension, please use EVADC_G4_Q1_QINR.
*/
#define EVADC_G4QINR1 (EVADC_G4_Q1_QINR)

/** \brief 1534, Queue 1 Backup Register, Group 4 */
#define EVADC_G4_Q1_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021534u)
/** Alias (User Manual Name) for EVADC_G4_Q1_QBUR.
* To use register names with standard convension, please use EVADC_G4_Q1_QBUR.
*/
#define EVADC_G4QBUR1 (EVADC_G4_Q1_QBUR)

/** \brief 1538, Queue 1 Requ. Timer Mode Reg., Group 4 */
#define EVADC_G4_Q1_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021538u)
/** Alias (User Manual Name) for EVADC_G4_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G4_Q1_REQTM.
*/
#define EVADC_G4REQTM1 (EVADC_G4_Q1_REQTM)

/** \brief 153C, Queue 1 Requ. Timer Status Reg., Group 4 */
#define EVADC_G4_Q1_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002153Cu)
/** Alias (User Manual Name) for EVADC_G4_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G4_Q1_REQTS.
*/
#define EVADC_G4REQTS1 (EVADC_G4_Q1_REQTS)

/** \brief 1540, Queue 2 Source Contr. Register, Group 4 */
#define EVADC_G4_Q2_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021540u)
/** Alias (User Manual Name) for EVADC_G4_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G4_Q2_QCTRL.
*/
#define EVADC_G4QCTRL2 (EVADC_G4_Q2_QCTRL)

/** \brief 1544, Queue 2 Mode Register, Group 4 */
#define EVADC_G4_Q2_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021544u)
/** Alias (User Manual Name) for EVADC_G4_Q2_QMR.
* To use register names with standard convension, please use EVADC_G4_Q2_QMR.
*/
#define EVADC_G4QMR2 (EVADC_G4_Q2_QMR)

/** \brief 1548, Queue 2 Status Register, Group 4 */
#define EVADC_G4_Q2_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021548u)
/** Alias (User Manual Name) for EVADC_G4_Q2_QSR.
* To use register names with standard convension, please use EVADC_G4_Q2_QSR.
*/
#define EVADC_G4QSR2 (EVADC_G4_Q2_QSR)

/** \brief 154C, Queue 2 Register 0, Group 4 */
#define EVADC_G4_Q2_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002154Cu)
/** Alias (User Manual Name) for EVADC_G4_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G4_Q2_Q0R.
*/
#define EVADC_G4Q0R2 (EVADC_G4_Q2_Q0R)

/** \brief 1550, Queue 2 Input Register, Group 4 */
#define EVADC_G4_Q2_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021550u)
/** Alias (User Manual Name) for EVADC_G4_Q2_QINR.
* To use register names with standard convension, please use EVADC_G4_Q2_QINR.
*/
#define EVADC_G4QINR2 (EVADC_G4_Q2_QINR)

/** \brief 1554, Queue 2 Backup Register, Group 4 */
#define EVADC_G4_Q2_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021554u)
/** Alias (User Manual Name) for EVADC_G4_Q2_QBUR.
* To use register names with standard convension, please use EVADC_G4_Q2_QBUR.
*/
#define EVADC_G4QBUR2 (EVADC_G4_Q2_QBUR)

/** \brief 1558, Queue 2 Requ. Timer Mode Reg., Group 4 */
#define EVADC_G4_Q2_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021558u)
/** Alias (User Manual Name) for EVADC_G4_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G4_Q2_REQTM.
*/
#define EVADC_G4REQTM2 (EVADC_G4_Q2_REQTM)

