Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEvadc_reg.h
/** \brief 1DF4, Ext. Multiplexer Channel Select Reg., Group 6 */
#define EVADC_G6_EMUXCS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCS*)0xF0021DF4u)
/** Alias (User Manual Name) for EVADC_G6_EMUXCS.
* To use register names with standard convension, please use EVADC_G6_EMUXCS.
*/
#define EVADC_G6EMUXCS (EVADC_G6_EMUXCS)

/** \brief 1DF8, Valid Flag Register, Group 6 */
#define EVADC_G6_VFR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_VFR*)0xF0021DF8u)
/** Alias (User Manual Name) for EVADC_G6_VFR.
* To use register names with standard convension, please use EVADC_G6_VFR.
*/
#define EVADC_G6VFR (EVADC_G6_VFR)

/** \brief 1E00, Group 6, Channel 0 Control Register */
#define EVADC_G6_CHCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E00u)
/** Alias (User Manual Name) for EVADC_G6_CHCTR0.
* To use register names with standard convension, please use EVADC_G6_CHCTR0.
*/
#define EVADC_G6CHCTR0 (EVADC_G6_CHCTR0)

/** \brief 1E04, Group 6, Channel 1 Control Register */
#define EVADC_G6_CHCTR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E04u)
/** Alias (User Manual Name) for EVADC_G6_CHCTR1.
* To use register names with standard convension, please use EVADC_G6_CHCTR1.
*/
#define EVADC_G6CHCTR1 (EVADC_G6_CHCTR1)

/** \brief 1E08, Group 6, Channel 2 Control Register */
#define EVADC_G6_CHCTR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E08u)
/** Alias (User Manual Name) for EVADC_G6_CHCTR2.
* To use register names with standard convension, please use EVADC_G6_CHCTR2.
*/
#define EVADC_G6CHCTR2 (EVADC_G6_CHCTR2)

/** \brief 1E0C, Group 6, Channel 3 Control Register */
#define EVADC_G6_CHCTR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E0Cu)
/** Alias (User Manual Name) for EVADC_G6_CHCTR3.
* To use register names with standard convension, please use EVADC_G6_CHCTR3.
*/
#define EVADC_G6CHCTR3 (EVADC_G6_CHCTR3)

/** \brief 1E10, Group 6, Channel 4 Control Register */
#define EVADC_G6_CHCTR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E10u)
/** Alias (User Manual Name) for EVADC_G6_CHCTR4.
* To use register names with standard convension, please use EVADC_G6_CHCTR4.
*/
#define EVADC_G6CHCTR4 (EVADC_G6_CHCTR4)

/** \brief 1E14, Group 6, Channel 5 Control Register */
#define EVADC_G6_CHCTR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E14u)
/** Alias (User Manual Name) for EVADC_G6_CHCTR5.
* To use register names with standard convension, please use EVADC_G6_CHCTR5.
*/
#define EVADC_G6CHCTR5 (EVADC_G6_CHCTR5)

/** \brief 1E18, Group 6, Channel 6 Control Register */
#define EVADC_G6_CHCTR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E18u)
/** Alias (User Manual Name) for EVADC_G6_CHCTR6.
* To use register names with standard convension, please use EVADC_G6_CHCTR6.
*/
#define EVADC_G6CHCTR6 (EVADC_G6_CHCTR6)

/** \brief 1E1C, Group 6, Channel 7 Control Register */
#define EVADC_G6_CHCTR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CHCTR*)0xF0021E1Cu)
/** Alias (User Manual Name) for EVADC_G6_CHCTR7.
* To use register names with standard convension, please use EVADC_G6_CHCTR7.
*/
#define EVADC_G6CHCTR7 (EVADC_G6_CHCTR7)

/** \brief 1E80, Group 6 Result Control Register 0 */
#define EVADC_G6_RCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E80u)
/** Alias (User Manual Name) for EVADC_G6_RCR0.
* To use register names with standard convension, please use EVADC_G6_RCR0.
*/
#define EVADC_G6RCR0 (EVADC_G6_RCR0)

/** \brief 1E84, Group 6 Result Control Register 1 */
#define EVADC_G6_RCR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E84u)
/** Alias (User Manual Name) for EVADC_G6_RCR1.
* To use register names with standard convension, please use EVADC_G6_RCR1.
*/
#define EVADC_G6RCR1 (EVADC_G6_RCR1)

/** \brief 1E88, Group 6 Result Control Register 2 */
#define EVADC_G6_RCR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E88u)
/** Alias (User Manual Name) for EVADC_G6_RCR2.
* To use register names with standard convension, please use EVADC_G6_RCR2.
*/
#define EVADC_G6RCR2 (EVADC_G6_RCR2)

/** \brief 1E8C, Group 6 Result Control Register 3 */
#define EVADC_G6_RCR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E8Cu)
/** Alias (User Manual Name) for EVADC_G6_RCR3.
* To use register names with standard convension, please use EVADC_G6_RCR3.
*/
#define EVADC_G6RCR3 (EVADC_G6_RCR3)

/** \brief 1E90, Group 6 Result Control Register 4 */
#define EVADC_G6_RCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E90u)
/** Alias (User Manual Name) for EVADC_G6_RCR4.
* To use register names with standard convension, please use EVADC_G6_RCR4.
*/
#define EVADC_G6RCR4 (EVADC_G6_RCR4)

/** \brief 1E94, Group 6 Result Control Register 5 */
#define EVADC_G6_RCR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E94u)
/** Alias (User Manual Name) for EVADC_G6_RCR5.
* To use register names with standard convension, please use EVADC_G6_RCR5.
*/
#define EVADC_G6RCR5 (EVADC_G6_RCR5)

/** \brief 1E98, Group 6 Result Control Register 6 */
#define EVADC_G6_RCR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E98u)
/** Alias (User Manual Name) for EVADC_G6_RCR6.
* To use register names with standard convension, please use EVADC_G6_RCR6.
*/
#define EVADC_G6RCR6 (EVADC_G6_RCR6)

/** \brief 1E9C, Group 6 Result Control Register 7 */
#define EVADC_G6_RCR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021E9Cu)
/** Alias (User Manual Name) for EVADC_G6_RCR7.
* To use register names with standard convension, please use EVADC_G6_RCR7.
*/
#define EVADC_G6RCR7 (EVADC_G6_RCR7)

/** \brief 1EA0, Group 6 Result Control Register 8 */
#define EVADC_G6_RCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EA0u)
/** Alias (User Manual Name) for EVADC_G6_RCR8.
* To use register names with standard convension, please use EVADC_G6_RCR8.
*/
#define EVADC_G6RCR8 (EVADC_G6_RCR8)

/** \brief 1EA4, Group 6 Result Control Register 9 */
#define EVADC_G6_RCR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021EA4u)
/** Alias (User Manual Name) for EVADC_G6_RCR9.
* To use register names with standard convension, please use EVADC_G6_RCR9.
*/
#define EVADC_G6RCR9 (EVADC_G6_RCR9)

